In [1]:
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

dataset = load_dataset("lukebarousse/data_jobs")
df = dataset['train'].to_pandas()

df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

README.md: 0.00B [00:00, ?B/s]

data_jobs.csv:   0%|          | 0.00/231M [00:00<?, ?B/s]

Generating train split:   0%|          | 0/785741 [00:00<?, ? examples/s]

In [10]:
df.loc[:,'salary_rate':'salary_hour_avg'].dropna(subset='salary_rate')

       salary_rate  salary_year_avg  salary_hour_avg
28            year         109500.0              NaN
43            hour              NaN             97.5
51            hour              NaN             72.5
77            year         140000.0              NaN
92            year         120000.0              NaN
...            ...              ...              ...
785624        year         139216.0              NaN
785641        year         150000.0              NaN
785648        year         221875.0              NaN
785682        year         157500.0              NaN
785692        year         157500.0              NaN

[33067 rows x 3 columns]

In [14]:
df.loc[:, ['job_title_short', 'salary_year_avg']].dropna(subset='salary_year_avg')

       job_title_short  salary_year_avg
28      Data Scientist         109500.0
77       Data Engineer         140000.0
92       Data Engineer         120000.0
100     Data Scientist         228222.0
109       Data Analyst          89000.0
...                ...              ...
785624   Data Engineer         139216.0
785641   Data Engineer         150000.0
785648  Data Scientist         221875.0
785682  Data Scientist         157500.0
785692  Data Scientist         157500.0

[22003 rows x 2 columns]